<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bca282ab086326a42a01f32860d29034709db456bc148034ebb25c0f565151e6","plan_job_ref":"Job Run Terraform plan in staging #127 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12589165626","plan_out_hash":"64c045bc4775a645024af691e7754b36bffdd32934e85c7df2a1665b2bdef4e0","plan_hash":"7a8e1026b34291768978df27493c1c6262b96b886b1d25b23aea8452e129ac56","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 3 to add, 4 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.external.set-app-space-egress will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "set-app-space-egress" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "set_space_egress.sh",
+           "-t",
+           "-s",
+           "capoc-stage",
+           "-o",
+           "gsa-tts-devtools-prototyping",
        ]
+       result      = (known after apply)
+       working_dir = "."
    }

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
+       command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_http_endpoint  = "/up"
+       health_check_type           = "http"
!~      id                          = "************************************" -> (known after apply)
+       instances                   = 1
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = "256M"
        name                        = "continuous_monitoring-staging"
-       processes                   = [
-           {
-               command                     = "bundle exec rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server" -> null
-               disk_quota                  = "2048M" -> null
-               health_check_type           = "port" -> null
-               instances                   = 1 -> null
-               log_rate_limit_per_second   = "-1" -> null
-               memory                      = "256M" -> null
-               readiness_health_check_type = "process" -> null
-               type                        = "web" -> null
            },
        ] -> null
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "mdntaAL1crxW59b4GwOged0cYDE9zQcV8/cChDtpXq0=" -> "NEt/aKAyd0e+z0VFUR5Eve6UkGQzOHJNAKkK8PUWIfk="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      strategy                    = "blue-green" -> "rolling"
!~      updated_at                  = "2024-12-26T21:50:56Z" -> (known after apply)
#        (7 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.app_space.cloudfoundry_space_role.developers["a6885c8a-c011-4d34-b988-abc8033d138f"] must be replaced
-/+ resource "cloudfoundry_space_role" "developers" {
!~      created_at = "2024-12-26T21:32:40Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply)
!~      updated_at = "2024-12-26T21:32:40Z" -> (known after apply)
-       username   = "a6885c8a-c011-4d34-b988-abc8033d138f" -> null # forces replacement
#        (3 unchanged attributes hidden)
    }

  # module.app_space.cloudfoundry_space_role.developers["ryan.ahearn@gsa.gov"] must be replaced
-/+ resource "cloudfoundry_space_role" "developers" {
!~      created_at = "2024-12-26T21:32:40Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply)
!~      updated_at = "2024-12-26T21:32:40Z" -> (known after apply)
-       username   = "ryan.ahearn@gsa.gov" -> null # forces replacement
#        (3 unchanged attributes hidden)
    }

  # module.app_space.cloudfoundry_space_role.managers["a6885c8a-c011-4d34-b988-abc8033d138f"] must be replaced
-/+ resource "cloudfoundry_space_role" "managers" {
!~      created_at = "2024-12-26T21:32:40Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply)
!~      updated_at = "2024-12-26T21:32:40Z" -> (known after apply)
-       username   = "a6885c8a-c011-4d34-b988-abc8033d138f" -> null # forces replacement
#        (3 unchanged attributes hidden)
    }

  # module.database.data.cloudfoundry_service_plans.rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "rds" {
+       name                  = "micro-psql"
+       service_offering_name = "aws-rds"
+       service_plans         = (known after apply)
    }

  # module.database.cloudfoundry_service_instance.rds will be updated in-place
!~  resource "cloudfoundry_service_instance" "rds" {
+       dashboard_url     = (known after apply)
        id                = "e304aaca-938d-4955-92c0-3013ba4196f4"
!~      last_operation    = {
!~          created_at  = "2024-12-26T21:38:45Z" -> (known after apply)
!~          description = "The service instance status is succeeded" -> (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "create" -> (known after apply)
!~          updated_at  = "2024-12-26T21:38:45Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "continuous_monitoring-rds-staging"
!~      service_plan      = "5ed9f319-4c75-4851-9885-598a96b7febc" -> (known after apply)
        tags              = [
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2024-12-26T21:32:43Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.egress_proxy.data.external.proxyzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "proxyzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-proxy.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy"
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      path                        = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy/proxy.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "af51150cd35106926b9402cb72da8002e1490af5362db1f5c8f799acd2f0daaf" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2024-12-26T21:33:03Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #127](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12589165626)